//转换S1240详细话单到文本格式

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include "../comm_convert_fun.h"
#include "../include/collect_convert_define.h"
#include "../../include/collect_convert_include.h"
#include "../../../include/toolbox.h"

//西门子话单文件中一个Block的长度
#define SIEMENS_BLOCK_SIZE	8192

//AMA文件在交换机硬盘和磁带上按照一个个Block存储，一个Block地长度是8192字节。若正常
//话单的长度不足8192字节，在记录的末尾会填充一些填充话单以达到8192字节的长度。

//每条记录的头结构
typedef struct
{
	unsigned char Phv;				//记录指示，为0x84表示话单长度可变
	unsigned char L_Rec_Len;		//L_Rec_Len和H_Rec_Len表示包括Header(SiemensP84H)
	unsigned char H_Rec_Len: 4;		//在内的整张话单的长度，12bits,低位在前
	unsigned char Res	   : 4;		//
	unsigned char Bill_Flag1 : 7;	//计费特性
	unsigned char F18 : 1;			//1-Record Owner Type in Fixed Part, 0-Record Owner DN in Fixed Part
	unsigned char Bill_Flag2[2];		//计费特性
	unsigned char PartialID : 4;	//部分记录指示(0－保留，1－单条，2－首张，3－中间，4－保留，5－末张)
	unsigned char ChargeFlag: 4;	//计费标记(0－未定义，1－计费，2－免费，3－被叫付费)
	unsigned char Rec_Owner_Type;
} SiemensP84H_Rec_Owner_Type;

//每条记录的头结构
typedef struct
{
	unsigned char Phv;				//记录指示，为0x84表示话单长度可变
	unsigned char L_Rec_Len;		//L_Rec_Len和H_Rec_Len表示包括Header(SiemensP84H)
	unsigned char H_Rec_Len: 4;		//在内的整张话单的长度，12bits,低位在前
	unsigned char Res	   : 4;		//
	unsigned char Bill_Flag1 : 7;	//计费特性
	unsigned char F18 : 1;			//1-Record Owner Type in Fixed Part, 0-Record Owner DN in Fixed Part
	unsigned char Bill_Flag2[2];		//计费特性
	unsigned char PartialID : 4;	//部分记录指示(0－保留，1－单条，2－首张，3－中间，4－保留，5－末张)
	unsigned char ChargeFlag: 4;	//计费标记(0－未定义，1－计费，2－免费，3－被叫付费)
	unsigned char Caller_Len: 5;	//主叫号码长度
	unsigned char LAC_Len   : 3;	//LAC长度
	//unsigned char Value[];		//主叫号码，长度由Caller_Len决定
} SiemensP84H_Rec_Owner_DN;

//通话时间
typedef struct 
{
	unsigned char Phv;			//值为0x64表示通话时间
	unsigned char Year;			//年，00－99
	unsigned char Month;		//月，1－12
	unsigned char Day;			//日，1－31
	unsigned char Hour;			//时，0－23
	unsigned char Minute;		//分，0－59
	unsigned char Second;		//秒，0－59
	unsigned char YearFlag : 1; //年份指示，0－1900至1999，1－2000～
	unsigned char Res      : 5;	//保留
	unsigned char Se_Flag  : 1;	//0－可靠时间，1－不可靠时间
	unsigned char Time_Flag: 1;	//0－通话开始时间，1－通话结束时间
	unsigned char Duration[3];	//通话时长
} SiemensP64H;

//被叫号码
typedef struct 
{
	unsigned char Phv;			//值为0x65表示被叫号码
	unsigned char Called_Len: 5;//被叫号码长度
	unsigned char Res       : 3;//保留
	//unsigned char Value[];	//被叫号码，长度由Called_Len决定
} SiemensP65H;

//业务信息
typedef struct 
{
    unsigned char Phv;			//0x66表示业务信息
	unsigned char ServiceInd;	//业务信息指示，Binary
	unsigned char AddInfo;		//附加信息
	unsigned char Flag : 1;		//
	unsigned char Res  : 7;		//保留
} SiemensP66H;

//呼叫计费单元
typedef struct
{
	unsigned char Phv;			//值为0x67表示计费单元
	unsigned char Ccu[3];		//计费单元(Call Charge Units)
} SiemensP67H;

//FAU计费单元
typedef struct
{
	unsigned char Phv;			//值为0x68表示FAU计费单元
	unsigned char Ccu[2];		//FAU计费单元
} SiemensP68H;

//入中继
typedef struct
{
	unsigned char Phv;				//值为0x69表示入中继
	unsigned char Tgrp_Name[6];		//中继群名称
	unsigned char Trunk_No_In[2];	//入中继群号，数值型，低位在前
} SiemensP69H;

//出中继
typedef struct
{
	unsigned char Phv;				//值为0x6A表示出中继
	unsigned char Tgrp_Name[6];		//中继群名称
	unsigned char Trunk_No_Out[2];	//出中继群号，数值型，低位在前
} SiemensP6AH;

//CIC入中继格式结构
typedef struct
{   
   unsigned char Phv;				//0x6B表示CIC入中继格式结构
   unsigned char Tgrp_Name[6];		//Tgrp_Name：中继群名称
   unsigned char CIC_Pn[2];			//CICpcm号
   unsigned char CIC_Cn;			//CIC计费号
} SiemensP6BH;

//CIC出中继格式结构
typedef struct
{   
   unsigned char Phv;				//0x6C表示CIC出中继格式结构
   unsigned char Tgrp_Name[6];		//中继群名称
   unsigned char CIC_Pn[2];			//CICpcm号	
   unsigned char CIC_Cn;			//CIC计费号
} SiemensP6CH;

typedef struct 
{
	unsigned char Phv;				//0x6E表示Connection Identifier Number
	unsigned char Len;				//长度，固定为0x06
	unsigned char ConnNum[4];		//Connection Number
} SiemensP6EH;

typedef struct 
{
	unsigned char Phv;				//0x6F表示Facilities Used By Owner
	unsigned char Len;				//
	//unsigned char OFac[];			//
} SiemensP6FH;

typedef struct 
{
	unsigned char Phv;				//0x70表示Facilities Used By Partner
	unsigned char Len;				//
	//unsigned char PFac[];			//
} SiemensP70H;

typedef struct 
{
	unsigned char Phv;			//值为0x74表示通话时间
	unsigned char Year;			//年，00－99
	unsigned char Month;		//月，1－12
	unsigned char Day;			//日，1－31
	unsigned char Hour;			//时，0－23
	unsigned char Minute;		//分，0－59
	unsigned char Second;		//秒，0－59
	unsigned char YearFlag : 1; //年份指示，0－1900至1999，1－2000～
	unsigned char Res      : 5;	//保留
	unsigned char Se_Flag  : 1;	//0－可靠时间，1－不可靠时间
	unsigned char Time_Flag: 1;	//0－通话开始时间，1－通话结束时间
} SiemensP74H;

typedef struct
{
	unsigned char Phv;			//0x75-Project Specific Data
	unsigned char Package_Len;	//表示该Package的长度，包括所有字段
} SiemensP75H;

typedef struct 
{
	unsigned char Phv;			//0x76,Digit String
	unsigned char Len;			//
	//unsigned char Digit[];	//
} SiemensP76H;

typedef struct 
{
	unsigned char Phv;			//0x77,Transmission Medium Requirement
	unsigned char Trans;		//0-3.1KHz, 1-Speech, 2-64K unrestricted, 3-64K unrestricted with fallback
} SiemensP77H;

typedef struct 
{
	unsigned char Phv;			//0x78,calling party category
	unsigned char CPC;			//
} SiemensP78H;

//计费区
typedef struct
{
	unsigned char Phv;			//值为0x7A表示区计费结构
	unsigned char Zone[2];		//计费区
} SiemensP7AH;

//计费区
typedef struct
{
	unsigned char Phv;			//值为0x7D Account Code
	unsigned char Len;			//
	unsigned char F1 : 1;		
	unsigned char Res: 7;
	unsigned char DigitNum;		//

	//unsigned char Digits[];	//
} SiemensP7DH;

//New Destination
typedef struct
{
	unsigned char Phv;			//0x80--New Destination
	unsigned char Len;			
	unsigned char NADI : 7;		//
	unsigned char Res1 : 1;
	unsigned char Res2 : 4;
	unsigned char NPI  : 3;
	unsigned char Res3 : 1;	
	unsigned char DigitNum : 5;
	unsigned char res4 : 3;
	//unsigned char Digits[];
} SiemensP80H;

//通话质量
typedef struct 
{
	unsigned char Phv;				//值为0x82表示通话质量
	unsigned char Package_Len;		//表示该Package的长度，包括所有字段
	unsigned char Cause_Value[2];	//释放原因(参见CCITT(Q.931)，共127种，16为正常释放)
	unsigned char Location : 4;		//位置指示(参见CCITT(Q.931)，共16种，2为本地公共网)
	unsigned char Res1 : 1;
	unsigned char CodingStandard : 2;
	unsigned char res2 : 1;
} SiemensP82H;

//Duration Before Answer
typedef struct
{
	unsigned char Phv;				//0x86-Duration Before Answer
	unsigned char Package_Len;		//表示该Package的长度，包括所有字段
	unsigned char Duration1[2];		//Duration from dial tone till address complete
	unsigned char Duration2[2];		//Duration from address complete till answer
} SiemensP86H;

//Chargeband
typedef struct
{
	unsigned char Phv;				//0x87-Chargeband
	unsigned char Package_Len;
	unsigned char Chargeband[2];
	unsigned char ChargebandMsg : 1; //0-No chargeband message, 1- chargeband message received
	unsigned char Res1 :7;
} SiemensP87H;

//UUS3 Counters
typedef struct
{
	unsigned char Phv;				//0x88-UUS3 Counters
	unsigned char Package_Len;
	unsigned char MsgReceived[2];
	unsigned char MsgSent[2];
} SiemensP88H;

//B Meter Pulses
typedef struct
{
	unsigned char Phv;				//0x8A-B Meter Pulse
	unsigned char Package_Len;
	unsigned char B_Meter_Pulses[2];
} SiemensP8AH;

//Release Indication
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char Release_Indication : 2;
	unsigned char Res1 : 6;
} SiemensP8BH;

//Incoming Route ID
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char RouteIndication : 2;
	unsigned char Res : 6;
	//subPackages
} SiemensP8CH;

//Outgoing Route ID
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char RouteIndication : 2;
	unsigned char Res : 6;
	unsigned char TrunkGroupName[6];
	unsigned char TrunkGroupLine[2];
} SiemensP8DH;

//主叫号码
typedef struct
{
	unsigned char Phv;				//值为0x8E表示主叫号码
	unsigned char Package_Len;		//表示该Package的长度，包括所有字段
	unsigned char NADI : 7   ;		//Nature of Address Indicator
	unsigned char Res1 : 1;
	unsigned char Screening : 2;
	unsigned char Present_Indicator : 2;
	unsigned char NPI : 3;			//Numbering Plan Indicator
	unsigned char Res2 : 1;
	unsigned char DigitNum : 5;
	unsigned char LAC_Len  : 3;
	//unsigned char packedDigits[];
} SiemensP8EH;

//IP/SN Charge Data
typedef struct
{
	unsigned char Phv;				//0x8F
	unsigned char Package_Len;
	//unsigned char Data[]; max 20 bytes
} SiemensP8FH;

//Billing CAC
typedef struct
{
	unsigned char Phv;				//0x91
	unsigned char Package_Len;
	unsigned char CACDigitsNum : 3;
	unsigned char PrefixDigitsNum : 2;
	unsigned char CACType : 3;
	//unsigned char packedDigits[]
} SiemensP91H;

//Third Party Number
typedef struct
{
	unsigned char Phv;				//0x92
	unsigned char Package_Len;
	unsigned char Type : 4;
	unsigned char Res1 : 4;
	unsigned char Res2;
	unsigned char NADI : 7;
	unsigned char Res3 : 1;
} SiemensP92H;

//Tariff Info
typedef struct
{
	unsigned char Phv;				//0x93
	unsigned char Package_Len;
	unsigned char CtrIndictr;
	unsigned char Currency;
	//subPackage
} SiemensP93H;

//CAC New Destination
typedef struct
{
	unsigned char Phv;				//0x94
	unsigned char Package_Len;
	unsigned char DigitsNum : 3;
	unsigned char Res1 : 5;
	//unsigned char packedDigits
} SiemensP94H;

//Global Charge Reference
typedef struct
{
	unsigned char Phv;				//0x95
	unsigned char Package_Len;
	unsigned char Res1;
	//unsigned char ChargeReference[];
} SimensP95H;

//Audit Trail
typedef struct
{
	unsigned char Phv;				//0x96
	unsigned char Package_Len;
	unsigned char SequenceNum[4];
	unsigned char CheckSum1;
	unsigned char CheckSum2;
} SimensP96H;

//Business Group Identification
typedef struct
{
	unsigned char Phv;				//0x97
	unsigned char Package_Len;
	unsigned char BusinessGrpID[3];
} SimensP97H;

//Centrex Numbers
typedef struct
{
	unsigned char Phv;				//0x98
	unsigned char Package_Len;
	unsigned char Res1;
	unsigned char DigitsNum;
	//unsigned char packedDigits[];
} SiemensP98H;

//Received Called Party Number
typedef struct
{
	unsigned char Phv;				//0x99
	unsigned char Package_Len;
	unsigned char NADI : 7;
	unsigned char Res1 : 1;
	unsigned char Res2 : 4;
	unsigned char NPI : 3;
	unsigned char Res3 : 1;
	unsigned char DigitsNum : 5;
	unsigned char CACDigitsNum : 3;
	//unsigned char packedDigits[];
} SiemensP99H;

//Additional Call Indicators
typedef struct
{
	unsigned char Phv;				//0x9A
	unsigned char Package_Len;
	unsigned char Res[4];
} SiemensP9AH;

//Add On Tariff
typedef struct
{
	unsigned char Phv;				//0x9B
	unsigned char Package_Len;
	unsigned char CtlIndictr;
	unsigned char Currency;
	//subPackages
} SiemensP9BH;

//Advised Cumulated Charges
typedef struct
{
	unsigned char Phv;				//0x97
	unsigned char Package_Len;
	unsigned char CtlFlag : 4;
	unsigned char AdviseType : 2;
	unsigned char Res1 : 2;
	unsigned char CurrencyOrPulses[3];
	unsigned char Multiplier;
} SiemensP9CH;

//Outgoing PA Identification
typedef struct
{
	unsigned char Phv;			//0x9D
	unsigned char Package_Len;
	unsigned char DigitsNum : 5;
	unsigned char LACDigitsNum : 3;
	//unsigned char packedDigits[];
} SiemensP9DH;

//Additional Calling Party Number
typedef struct
{
	unsigned char Phv;			//0x9F
	unsigned char Package_Len;
	unsigned char NADI : 7;
	unsigned char Res1 : 1;
	unsigned char Screening : 2;
	unsigned char Pres_Indictr : 2;
	unsigned char NPI : 3;
	unsigned char Res2 : 1;
	unsigned char DigitsNum : 5;
	unsigned char Res3 : 3;
} SiemensP9FH;

//Additional Numbers
typedef struct
{
	unsigned char Phv;			//0xA7
	unsigned char Package_Len;
	unsigned char StringsNum;
	unsigned char NumType : 4;
	unsigned char NumQualifier : 4;
	unsigned char NADI : 7;
	unsigned char Res1 : 1;
	unsigned char Res2 : 4;
	unsigned char NPI : 3;
	unsigned char Res3 : 1;
	unsigned char DigitsNum : 5;
	unsigned char Res4 : 3;
} SiemensPA7H;

//Called Party Number
typedef struct
{
	unsigned char Phv;				//0xA8
	unsigned char Package_Len;		//表示该Package的长度，包括所有字段
	unsigned char NADI : 7;			//
	unsigned char Res1 : 1;
	unsigned char Res2 : 4;
	unsigned char NPI : 3;
	unsigned char Res3 : 1;
	unsigned char DigitsNum : 5;
	unsigned char LAC_Len : 3;
	//unsigned char packedDigits[];
} SiemensPA8H;

//Redirecting Num
typedef struct
{
	unsigned char Phv;				//0xAA;
	unsigned char Package_Len;
	unsigned char NADI : 7;
	unsigned char Res1 : 1;
	unsigned char Res2 : 2;
	unsigned char Pres_Indictr : 2;
	unsigned char NPI : 3;
	unsigned char Res3 : 1;
	unsigned char DigitsNum : 5;
	unsigned char LACLen : 3;
	//unsigned char packedDigits[];
} SiemensPAAH;

//Sent Called Party Number
typedef struct
{
	unsigned char Phv;				//0xAB
	unsigned char Package_Len;		//表示该Package的长度，包括所有字段
	unsigned char NADI : 7;			//
	unsigned char Res1 : 1;
	unsigned char Res2 : 4;
	unsigned char NPI : 3;
	unsigned char Res3 : 1;
	unsigned char DigitsNum : 5;
	unsigned char LAC_Len : 3;
	//unsigned char packedDigits[];
} SiemensPABH;

//System Provided Number
typedef struct
{
	unsigned char Phv;				//0xAC
	unsigned char Package_Len;
	unsigned char NumType : 4;
	unsigned char NumQulifier : 4;
	unsigned char NADI : 7;
	unsigned char Res1 : 1;
	unsigned char Res2 : 4;
	unsigned char NPI : 3;
	unsigned char Res3 : 1;
	unsigned char DigitsNum : 5;
	unsigned char LACNum : 3;
	//unsigned char packedDigits[];
} SiemensPACH;

//ITU Calling Party Category
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char ITU_Calling_Party_Category;
} SiemensPB0H;

//Project Specific Service 
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char TeleService;
	unsigned char BearerCapability;
} SiemensPB1H;

//Exchange Info
typedef struct
{
	unsigned char Phv;				//0xB2
	unsigned char Package_Len;
	unsigned char Va0 : 1;
	unsigned char Va1 : 1;
	unsigned char Res1 : 6;
	unsigned char VerID;
	unsigned ExchangeID_Len : 4;
	unsigned char Res2 : 4;
	//unsigned char ExchangeID[], max 11 bytes;
} SiemensPB2H;

//Service Subscriber Number
typedef struct
{
	unsigned char Phv;				//0xB3
	unsigned char Package_Len;
	unsigned char Qualifier : 4;
	unsigned char Res1 : 4;
	unsigned char NotApplicable;
	unsigned char DigitsNum : 6;
	unsigned char Coding : 2;
	//unsigned char packedDigits[]
} SiemensPB3H;

//Internet Session Info
typedef struct
{
	unsigned char Phv;
	unsigned char Pacakge_Len;
	//subPackages
} SiemensPB5H;

//Operator Connection Duration
typedef struct
{
	unsigned char Phv;				//0xB6
	unsigned char Package_Len;
	unsigned char Duration[2];
} SiemensPB6H;

//Sent CAC
typedef struct
{
	unsigned char Phv;				//0xB7
	unsigned char Package_Len;
	unsigned char CACDigitsNum : 3;
	unsigned char Res : 5;
	//unsigned char packedDigits[];
} SiemensPB7H;

//MLPP Level
typedef struct
{
	unsigned char Phv;				//0xB8
	unsigned char Package_Len;
	unsigned char PrecedenceLevel : 4;
	unsigned char Res1 : 1;
	unsigned char LFB : 2;
	unsigned char Res2 : 1;
	unsigned char NetworkID[2];
	unsigned char ServiceDomain[3];
} SiemensPB8H;

//IN Service Key
typedef struct
{
	unsigned char Phv;				//0xBA
	unsigned char Package_Len;
	unsigned char Key[4];
} SiemensPBAH;

//Received CAC
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char CACDigitsNum : 3;
	unsigned char Res1 : 5;
	//unsigned char packedDigits[];
} SiemensPBBH;

//Signalling Point Code
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char NetworkIndictr : 2;
	unsigned char Res : 6;
	unsigned char SignallingPointCode[3];
} SiemensPBFH;

//Sent Calling Party Number
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char NADI : 7;
	unsigned char Res1 : 1;
	unsigned char Screening : 2;
	unsigned char PresIndictr : 2;
	unsigned char NPI : 3;
	unsigned char Res2 : 1;
	unsigned char DigitsNum : 5;
	unsigned char LACDigitsNum : 3;
	//unsigned char packedDigits[];
} SiemensPC0H;

//Sent Redirecting Number
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char NADI : 7;
	unsigned char Res1 : 1;
	unsigned char Res2 : 4;
	unsigned char NPI : 3;
	unsigned char Res3 : 1;
	unsigned char DigitsNum : 5;
	unsigned char LACDigitsNum : 3;
	//unsigned char packedDigits[];
} SiemensPC1H;

//Sent Calling Party Category
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char Category;
} SiemensPC2H;

//Original Calling Party Category
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char Category;
} SiemensPC3H;

//Trunk Info
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	//subPackages
} SiemensPC4H;

//Durations in 100ms
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	//subPackages
} SiemensPC6H;

//Received Charged Determination Information
typedef struct
{
	unsigned char Phv;
	unsigned char Package_Len;
	unsigned char CDI : 1;
	unsigned char Res : 7;
} SiemensPC7H;

//若不足的字节数是1个或者两个字节，就用0x80填充，他只有一个字节，结构如下:
typedef struct
{
   unsigned char Phv;
} SiemensP80H_Fill_Rec1;

//若不足的字节数超过两个字节，就用0x81类型的话单填充，结构如下:
typedef struct
{
   unsigned char Phv;			//0x81
   unsigned char Rec_Len[2];	//填充记录的长度，包括所有字段
   //unsigned char Filler[];		//填充字节，任意值
} SiemensP81H_Fill_Rec2;

//填充32个bytes
typedef struct
{
	unsigned char Phv;			//0x00
	unsigned char Rec_Value[31];
} SiemensP00H_Fill_Rec3;

//转换成文本格式的西门子话单结构
struct SiemensDestFmt
{
	char szTime[14];		//通话时间YYYYMMDDhhmmss
	char szCallerNum[15];	//主叫号码
	char szCalledNum[15];	//被叫号码
	char szDuration[6];		//通话时长
	char szPartialID[3];	//部分记录指示
	char szChargeFlag[3];	//计费免费指示
	char szSeFlag[3];		//可靠/不可靠时间指示
	char szTimeFlag[3];		//起始/终止时间指示
	char szInTrunk[6];		//入中继
	char szOutTrunk[6];		//出中继
	char szInCicPn[6];		//入CIC pcm
	char szInCicCn[6];		//入CIC计费号码
	char szOutCicPn[6];		//出CIC pcm
	char szOutCicCn[6];		//出CIC计费号码	

	//char szCcu[5];		//呼叫计费
	//char szFau[5];		//FAU计费
	//char szZone[5];		//计费区
	//char szCause[4];		//呼叫释放原因
	//char szLoc[3];		//位置指示

	char szReturn[1];
};


int ConvertAEWSDAMACDR(unsigned char*& pRec, SiemensDestFmt& CDR, int& nLeftBytes, int& nRecordLen);
int ValideEWSDAMACDR(SiemensDestFmt& DestCDR);

int ValidateEWSDDateTime(const char* pszDateTime);

int ProcessEWSDAMAFile(const char* pszSrcFile,
